## Read & Write data from Database
Reading database records into Pandas DataFrame and write it back...

In [2]:
import pandas as pd
import sqlalchemy

In [5]:
engine = sqlalchemy.create_engine("mysql+pymysql://root:@localhost:3306/jupyterDB")

In [25]:
# To read the first table 'customers':
df = pd.read_sql_table("customers", engine)
df

   id    name  phone_number
0   1  Faisal     787667564
1   2   Fawad     773463435
2   3    Sana     798767864

In [26]:
# To read the 2nd column 'orders':
df = pd.read_sql_table("orders", engine)
df

   id       name  amount  customer_id
0   1  Computers      30            1
1   2  Galaxy G7      25            2
2   3   Chargers      50            3
3   4     Iphone      15            2

In [24]:
# We can display a specific columns:
df = pd.read_sql_table("customers", engine, columns = ["name", "phone_number"])
df

     name  phone_number
0  Faisal     787667564
1   Fawad     773463435
2    Sana     798767864

In [28]:
# We can execute and read the same queries in pandas DataFrame, Let's see the basic join query:
query = '''
SELECT customers.name, customers.phone_number, orders.name, orders.amount 
FROM customers INNER JOIN orders 
ON customers.id = orders.customer_id; 
'''
df = pd.read_sql_query(query, engine)
df

     name  phone_number       name  amount
0  Faisal     787667564  Computers      30
1   Fawad     773463435  Galaxy G7      25
2    Sana     798767864   Chargers      50
3   Fawad     773463435     Iphone      15

This query was pretty simple, if you have big reports to read in pandas, you can use 'chunksize' argument. For other argument check 'pandas read_sql_query documentation'

In [29]:
# Now lets do reverse operation which is back writing from DataFrame into SQL Tables:
# So we have a CSV file which have a customer data:
df1 = pd.read_csv("CSV Files/customers.csv")
df1

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [35]:
# We want to insert this data into customers table:
# Before that we rename the column names of our DataFrame:
df1.rename (columns = {
    "Customer Name": 'name',
    "Customer Phone": 'phone_number'
}, inplace = True)
df1

              name  phone_number
0     rafael nadal    4567895647
1  maria sharapova     434534545
2   vladimir putin      89345345
3      kim un jong     123434456
4       jeff bezos     934534543
5     rahul gandhi      44324222

In [37]:
# Now to insert the data, we use to_sql method:
df1.to_sql(
    name = 'customers',
    con = engine,
    index = False,
    if_exists = 'append'
)

6

It doesn't give an error, so the data is inerted succesfully.

In [38]:
# Now again to read customers table:
df = pd.read_sql_table("customers", engine)
df

   id             name  phone_number
0   1           Faisal     787667564
1   2            Fawad     773463435
2   3             Sana     798767864
3   4     rafael nadal    2147483647
4   5  maria sharapova     434534545
5   6   vladimir putin      89345345
6   7      kim un jong     123434456
7   8       jeff bezos     934534543
8   9     rahul gandhi      44324222

In [39]:
# We can also pass a query to 'read_sql' method.
query='''
Select customers.name
From customers
Where customers.id=2
'''
pd.read_sql(query, engine)

    name
0  Fawad

Thats were all about read and write of SQL Database...